fio_test_res2_read/128_128k.txt
test: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=128
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=95957: Thu Aug 14 19:25:03 2025
  read: IOPS=17.1k, BW=2137MiB/s (2241MB/s)(20.9GiB/10012msec)
    slat (nsec): min=437, max=8981, avg=714.85, stdev=164.17
    clat (usec): min=206, max=28116, avg=7482.80, stdev=5128.26
     lat (usec): min=207, max=28117, avg=7483.51, stdev=5128.26
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[ 1205], 10.00th=[ 1729], 20.00th=[ 2769],
     | 30.00th=[ 3818], 40.00th=[ 4883], 50.00th=[ 6128], 60.00th=[ 7635],
     | 70.00th=[ 9896], 80.00th=[12780], 90.00th=[15401], 95.00th=[17171],
     | 99.00th=[19792], 99.50th=[20579], 99.90th=[21627], 99.95th=[22152],
     | 99.99th=[25035]
   bw (  MiB/s): min=   31, max= 2157, per=95.35%, avg=2038.07, stdev=459.80, samples=21
   iops        : min=  254, max=17258, avg=16304.57, stdev=3678.43, samples=21
  lat (usec)   : 250=0.01%, 500=0.28%, 750=1.19%, 1000=1.83%
  lat (msec)   : 2=9.29%, 4=19.25%, 10=38.63%, 20=28.75%, 50=0.77%
  cpu          : usr=99.97%, sys=0.02%, ctx=8, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=171198,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2137MiB/s (2241MB/s), 2137MiB/s-2137MiB/s (2241MB/s-2241MB/s), io=20.9GiB (22.4GB), run=10012-10012msec