fio_test_res2_read/128_64k.txt
test: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=spdk, iodepth=128
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=95136: Thu Aug 14 19:24:49 2025
  read: IOPS=33.3k, BW=2080MiB/s (2181MB/s)(20.3GiB/10005msec)
    slat (nsec): min=294, max=6251, avg=416.59, stdev=108.06
    clat (usec): min=147, max=19111, avg=3844.65, stdev=3958.52
     lat (usec): min=147, max=19111, avg=3845.07, stdev=3958.52
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  545], 10.00th=[  693], 20.00th=[  979],
     | 30.00th=[ 1287], 40.00th=[ 1647], 50.00th=[ 2147], 60.00th=[ 2802],
     | 70.00th=[ 3982], 80.00th=[ 6456], 90.00th=[10814], 95.00th=[13042],
     | 99.00th=[15664], 99.50th=[16581], 99.90th=[17957], 99.95th=[18220],
     | 99.99th=[18744]
   bw (  MiB/s): min=   15, max= 2099, per=95.29%, avg=1981.73, stdev=450.62, samples=21
   iops        : min=  254, max=33596, avg=31707.62, stdev=7209.96, samples=21
  lat (usec)   : 250=0.10%, 500=3.73%, 750=8.15%, 1000=8.86%
  lat (msec)   : 2=26.71%, 4=22.55%, 10=18.22%, 20=11.67%
  cpu          : usr=99.96%, sys=0.02%, ctx=7, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=332930,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2080MiB/s (2181MB/s), 2080MiB/s-2080MiB/s (2181MB/s-2181MB/s), io=20.3GiB (21.8GB), run=10005-10005msec