fio_test_res2_read/16_128k.txt
test: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=16
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=74338: Thu Aug 14 19:19:30 2025
  read: IOPS=15.6k, BW=1950MiB/s (2045MB/s)(19.0GiB/10001msec)
    slat (nsec): min=426, max=5969, avg=533.96, stdev=122.28
    clat (usec): min=186, max=11583, avg=1024.27, stdev=465.03
     lat (usec): min=187, max=11584, avg=1024.80, stdev=465.03
    clat percentiles (usec):
     |  1.00th=[  330],  5.00th=[  429], 10.00th=[  506], 20.00th=[  619],
     | 30.00th=[  725], 40.00th=[  832], 50.00th=[  947], 60.00th=[ 1074],
     | 70.00th=[ 1205], 80.00th=[ 1385], 90.00th=[ 1647], 95.00th=[ 1876],
     | 99.00th=[ 2376], 99.50th=[ 2606], 99.90th=[ 3326], 99.95th=[ 3556],
     | 99.99th=[ 4228]
   bw (  MiB/s): min= 1932, max= 1965, per=100.00%, avg=1950.55, stdev= 8.75, samples=20
   iops        : min=15460, max=15726, avg=15604.40, stdev=70.01, samples=20
  lat (usec)   : 250=0.06%, 500=9.65%, 750=22.57%, 1000=22.49%
  lat (msec)   : 2=41.78%, 4=3.43%, 10=0.02%, 20=0.01%
  cpu          : usr=99.96%, sys=0.02%, ctx=5, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156044,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1950MiB/s (2045MB/s), 1950MiB/s-1950MiB/s (2045MB/s-2045MB/s), io=19.0GiB (20.5GB), run=10001-10001msec