fio_test_res2_read/1_1k.txt
test: (g=0): rw=randread, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=62692: Thu Aug 14 19:16:29 2025
  read: IOPS=11.8k, BW=11.5MiB/s (12.1MB/s)(115MiB/10001msec)
    slat (nsec): min=149, max=7120, avg=172.75, stdev=58.01
    clat (usec): min=17, max=671, avg=83.94, stdev=33.29
     lat (usec): min=17, max=671, avg=84.11, stdev=33.29
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   48], 10.00th=[   48], 20.00th=[   49],
     | 30.00th=[   65], 40.00th=[   66], 50.00th=[   83], 60.00th=[   96],
     | 70.00th=[   97], 80.00th=[   99], 90.00th=[  151], 95.00th=[  153],
     | 99.00th=[  155], 99.50th=[  155], 99.90th=[  157], 99.95th=[  163],
     | 99.99th=[  210]
   bw (  KiB/s): min=11642, max=11916, per=100.00%, avg=11817.30, stdev=71.41, samples=20
   iops        : min=11642, max=11916, avg=11817.30, stdev=71.41, samples=20
  lat (usec)   : 20=0.08%, 50=23.01%, 100=58.77%, 250=18.15%, 500=0.01%
  lat (usec)   : 750=0.01%
  cpu          : usr=99.96%, sys=0.01%, ctx=4, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=118173,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=11.5MiB/s (12.1MB/s), 11.5MiB/s-11.5MiB/s (12.1MB/s-12.1MB/s), io=115MiB (121MB), run=10001-10001msec