fio_test_res2_read/32_16k.txt
test: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=spdk, iodepth=32
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=78254: Thu Aug 14 19:20:39 2025
  read: IOPS=110k, BW=1727MiB/s (1810MB/s)(16.9GiB/10001msec)
    slat (nsec): min=178, max=8968, avg=204.40, stdev=55.83
    clat (usec): min=55, max=10068, avg=288.92, stdev=142.88
     lat (usec): min=56, max=10069, avg=289.12, stdev=142.88
    clat percentiles (usec):
     |  1.00th=[  102],  5.00th=[  135], 10.00th=[  159], 20.00th=[  184],
     | 30.00th=[  210], 40.00th=[  235], 50.00th=[  262], 60.00th=[  293],
     | 70.00th=[  326], 80.00th=[  375], 90.00th=[  453], 95.00th=[  529],
     | 99.00th=[  709], 99.50th=[  791], 99.90th=[ 1156], 99.95th=[ 2311],
     | 99.99th=[ 3097]
   bw (  MiB/s): min= 1704, max= 1744, per=100.00%, avg=1726.73, stdev=10.98, samples=20
   iops        : min=109100, max=111628, avg=110510.50, stdev=702.60, samples=20
  lat (usec)   : 100=0.87%, 250=44.82%, 500=47.85%, 750=5.78%, 1000=0.54%
  lat (msec)   : 2=0.09%, 4=0.06%, 10=0.01%, 20=0.01%
  cpu          : usr=99.97%, sys=0.00%, ctx=8, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=1105106,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1727MiB/s (1810MB/s), 1727MiB/s-1727MiB/s (1810MB/s-1810MB/s), io=16.9GiB (18.1GB), run=10001-10001msec